{
  "general.button.close": "Close",
  "general.button.open": "Open",
  "general.button.see": "View",
  "general.button.see-less": "See less",
  "general.button.see-more": "See More",
  "general.button.go-back": "Back",
  "general.loading.hint": "Loading",
  "not-available.text": "It appears that you have accessed this screen with a device that is not yet supported. But don't worry, in a not so distant time this will be resolved. In the meantime, how about taking the opportunity to relax and have a cup of coffee while you wait? Or better yet, try to access my portfolio from desktop or mobile?",
  "header.links.section.about-me": "About me",
  "header.links.section.curriculum": "Curriculum",
  "header.links.section.experience": "Experience",
  "header.links.section.formation": "Education",
  "header.links.section.projects": "Projects",
  "header.links.section.stack": "My Stack",
  "header.links.section.trajectory": "Timeline",
  "home.about-me.formation": "Education",
  "home.about-me.formation.first": "Associate in Systems Analysis and Development by FIAP",
  "home.about-me.formation.second": "Technical in Internet I.T by ETEC",
  "home.about-me.hobbies": "Hobbies",
  "home.about-me.hobbies.first": "Books, music",
  "home.about-me.hobbies.second": "Movies, tv shows",
  "home.about-me.hobbies.third": "Games and tabletop games",
  "home.about-me.objectives": "Goals",
  "home.about-me.objectives.first": "A job that brings me stability and confidence to always work with excellence.",
  "home.about-me.objectives.fourth": "Achieve a postgraduate degree in the area of ​​software development.",
  "home.about-me.objectives.second": "Deepen my knowledge in cloud.",
  "home.about-me.objectives.third": "Become a full stack dev",
  "home.about-me.overview": "Overview",
  "home.about-me.stack": "Stack",
  "home.about-me.stack.first": "Extensive experience with Typescript",
  "home.about-me.stack.fourth": "Knowledge in Cloud (AWS)",
  "home.about-me.stack.second": "Extensive experience with Javascript",
  "home.about-me.stack.third": "Git and Gitflow",
  "home.about-me.summary1": "I'm a young front-end developer with 4 years of experience. My trajectory includes working in companies of varied sizes, from small startups to large multinational companies. I'm always ready to face new challenges and reinvent myself in the face of constant changes. I'm known for being a collaborative and empathetic person, always willing to help and exchange knowledge with my colleagues.",
  "home.about-me.summary2": "From an early age, I was interested in technology and computing. At the age of 16, I started my studies on a technical course and went on to become a formed technitian at the end of my high school years. Over the years, I kept studying and constantly updating myself, following trends and news in the IT market, especially in the Javascript and Typescript ecosystem.",
  "home.about-me.summary3": "I'm always looking for new challenges and learning, and I know that this is a path that has no end, because technology is constantly evolving and you always need to be up to date to keep up with this accelerated pace.",
  "home.about-me.title": "About me",
  "home.aws.amplify.description": "AWS toolset and services that enable you to build web and mobile applications quickly and easily. Providing a complete development framework to create applications with features such as authentication, data storage. And it still allows the creation of applications using technologies such as React, React Native, Angular, in addition to being able to connect your applications to AWS services such as Amazon S3 and Amazon Cognito.",
  "home.aws.api-gateway.description": "Used to expose and control APIs through the AWS infrastructure, a very common use case that I have particularly used is the integration with Lambdas functions for endpoints within the API Gateway, where it is possible to configure Tokens, API Keys, CORS, and so on.",
  "home.aws.cloud-dev-kit.description": "In particular, I only developed applications for study purposes, but I already had to carry out maintenance on projects that used the concept of IaC in AWS and, consequently, the CDK. The flow boiled down to generating the CDK to deploy it on CloudFront, or even generating stacks in cloud formation. The great benefit of using the CDK is being able to write IAC using a language of your choice.",
  "home.aws.cloudformation.description": "Creating process stacks within AWS to automate and facilitate deployment of applications across multiple accounts or regions. Typically used in conjunction with the AWS CDK to realize infrastructure as code (IAC). I've worked with projects that relied on CloudFormation to distribute applications consistently across multiple AWS accounts, ensuring a healthy independent infrastructure.",
  "home.aws.cloudfront.description": "AWS Cloud Content Delivery (CDN). It can be integrated with Route 53 to deliver website distributions across domains which, coupled with the AWS network of CDNs, allows you to cache files on a global infrastructure for extremely efficient load times.",
  "home.aws.codebuild.description": "Used to create steps in compiling and building the code, it can be used to generate artifacts that are consequently sent to S3, for example, as was the case in my portfolio.",
  "home.aws.codecommit.description": "I usually use github but I've had to use the AWS private repository service. It is extremely similar to Github but has the advantage of being natively integrated into the AWS environment, so it is possible to have much more integration with the application code than using a third-party alternative.",
  "home.aws.cognito.description": "Managed service that allows you to add user authentication, authorization, and management capabilities to web and mobile applications. In the projects I've participated in that used Cognito, they enabled users to register, login, and access resources with authentication based on users or social identity providers such as Facebook and Google. Functionalities that exist in many applications but are enabled by Amazon Cognito",
  "home.aws.lambda.description": "FaaS (Function as a Service), where I've particularly developed lambda functions with NodeJS for integrations to the API Gateway for applications to be able to invoke them on an as-needed basis. But its use can be much more than that, the API Gateway is just one of the ways to invoke a lambda function",
  "home.aws.s3.description": "Perhaps the best known AWS service, responsible for storing the most diverse forms of static data in the cloud, be it folders, images, pdfs... In fact, all the assets in my portfolio are hosted in an s3 bucket I created. From my experience, the use of S3 buckets are diverse and can be used for hosting websites, long-term storage of objects and even to store assets.",
  "home.certifications1.title": "Certified Cloud Practitioner",
  "home.certifications2.title": "TOEFL ITP",
  "home.certifications3.title": "English course",
  "home.certifications4.title": "Systems Analysis and Development",
  "home.certifications5.title": "Computers for Internet",
  "home.certifications6.title": "App Developer",
  "home.certifications7.title": "Web Designer",
  "home.dart.async-await": "Async Await",
  "home.dart.collections": "Collections",
  "home.dart.description": "I had my first contact with Dart just as I started to have an interest in learning Flutter. Consequently, my experience is similar. I have knowledge in basic concepts such as asynchronous functions, classes and interfaces.",
  "home.dart.flutter.dart": "Dart",
  "home.dart.flutter.description": "Although I don't have a lot of professional Flutter experience yet, I've learned a lot from it on personal projects and a few personal projects. I also had the opportunity to work briefly on a professional project with Flutter mobile. My knowledge is mainly focused on Flutter for mobile devices, I am aware that it can be used for desktop and web app development, but particularly, I still got to use it.",
  "home.dart.flutter.material-design-cupertino": "Material Design and Cupertino",
  "home.dart.flutter.state-management": "State Management",
  "home.dart.flutter.widgets": "Widgets",
  "home.dart.typing": "Optional typing",
  "home.experience.current": "Current",
  "home.experience.description": "Description",
  "home.experience.enext-development-program.company": "Enext",
  "home.experience.enext-development-program.date": "09/2019 - 10/2019",
  "home.experience.enext-development-program.description1": "During my first front end training program, I had the opportunity to learn from experienced professionals in the field. The program consisted of a selection process for an internship position, where I learned how to use important tools such as Git, VTEX, Html, Css and Sass, and also deepened my knowledge in Javascript.",
  "home.experience.enext-development-program.description2": "Throughout the program, I was challenged to present what I learned on a weekly basis, which allowed me to develop my communication skills and enhance my understanding of the concepts covered. In the last week, we were given the task of creating a final project that incorporated everything we had learned throughout the program.",
  "home.experience.enext-development-program.stack": "HTML, SCSS, Javascript, Git",
  "home.experience.enext-development-program.title": "Front-End Training Program",
  "home.experience.enext-development-program.type": "On-site",
  "home.experience.enext-intern.company": "Enext",
  "home.experience.enext-intern.date": "10/2019 - 09/2020",
  "home.experience.enext-intern.description1": "Being promoted through the Training Program process, I started to receive job responsibilities in the Ongoing department, i.e., I had the objective of meeting the clients' recurring demands.",
  "home.experience.enext-intern.description2": "Being in a company with varied clients, I could have contact with several technologies and different projects, including traditional technologies of the front end world like Javascript, HTML and CSS. As my first professional experience, it was my first opportunity to get in touch with many technologies that today are part of my specialty, such as: Git, Angular and React.",
  "home.experience.enext-intern.stack": "HTML, PUG, SCSS, Javascript, React, Magento, VTEX, Git",
  "home.experience.enext-intern.title": "Front-End Internship",
  "home.experience.enext-intern.type": "Hybrid",
  "home.experience.enext-junior.company": "Enext",
  "home.experience.enext-junior.date": "09/2020 - 12/2020",
  "home.experience.enext-junior.description1": "Promoted to Junior, I continued performing the Ongoing demands but now also being part of the project department. I continued working and deepening my knowledge in the Ecommerce platforms of my internship: Wordpress, VTEX and Magento. Continuing with task automation tools like Gulp and Grunt.",
  "home.experience.enext-junior.description2": " My work also continued to involve the use of technologies such as Typescript, Javascript, React and Jquery, where I was able to apply my knowledge and skills to provide efficient and quality solutions to the projects I participated in. In addition, I began to have responsibilities of participating in technical presentations for various clients, providing me with a unique and valuable experience for my career.",
  "home.experience.enext-junior.stack": "PUG, SCSS, Javascript, React, Wordpress, VTEX, Git, Gulp, Grunt",
  "home.experience.enext-junior.title": "Junior Front-End",
  "home.experience.enext-junior.type": "Home Office",
  "home.experience.gft-mid-level.company": "GFT",
  "home.experience.gft-mid-level.date": "04/2022 - 09/2022",
  "home.experience.gft-mid-level.description1": "During my time at GFT, I participated in an internal project that gave me the opportunity to work with AWS, in particular with services like S3, CloudFormation, RDS, Lambda, API Gateway and CodeBuild.",
  "home.experience.gft-mid-level.description2": "I worked mainly on developing solutions in React on the front end, while simultaneously working on maintaining existing functions on the back end with Node and Lambda. In summary, my experience working at GFT was extremely positive and gave me new knowledge and skills, especially in the Cloud area and my first contact with the backend.",
  "home.experience.gft-mid-level.stack": "React, Typescript, AWS, Git, Devops, Lambda, Node",
  "home.experience.gft-mid-level.title": "Front End Midlevel",
  "home.experience.gft-mid-level.type": "Home Office",
  "home.experience.ibm-mid-level.company": "IBM",
  "home.experience.ibm-mid-level.date": "09/2022 - Current",
  "home.experience.ibm-mid-level.description1": "I have been working with an emphasis on unit testing, Rest API integration, GraphQL, Typescript, Angular and using Flame as a component library. I am also responsible for performing code reviews of pull requests and organizing workshops to help my colleagues on a daily basis.",
  "home.experience.ibm-mid-level.description2": "I actively contribute to the development of an internal library that is shared among the project's micro front-ends. Throughout my time at IBM, I have had the opportunity to improve my technical and behavioral skills, as well as acquire new knowledge and practices that contribute to my education as a technology professional.",
  "home.experience.ibm-mid-level.stack": "Typescript, Devops, Angular, Git, Sass, HTML, Unit testing, Flame, GraphQL",
  "home.experience.ibm-mid-level.title": "Front End Midlevel",
  "home.experience.ibm-mid-level.type": "Hybrid",
  "home.experience.nbm-junior.company": "NBM Computing",
  "home.experience.nbm-junior.date": "03/2021 - 04/2022",
  "home.experience.nbm-junior.description1": "At NBM, I had the opportunity to work on in-house projects for retail systems, parcel tracking and postage. One of the main experiences I had at NBM was the responsibility of helping to directly manage a person.",
  "home.experience.nbm-junior.description2": "I worked on projects that used React Native, Angular, and even some Flutter. This allowed me to broaden my skills in different technologies and become a more complete developer. Overall, my experience at NBM was very enriching, both in terms of learning and personal and professional development. I appreciate the opportunity that I had to work on important projects and contribute to the success of the company.",
  "home.experience.nbm-junior.stack": "PUG, SCSS, Typescript, Angular, React Native, AWS, Git, Gulp, Flutter",
  "home.experience.nbm-junior.title": "Junior Front-End",
  "home.experience.nbm-junior.type": "Hybrid",
  "home.experience.stack": "Technologies",
  "home.experience.title": "Professional Experience",
  "home.extracurricular1.description": "I studied English at the CCAA from 2013 to 2018. I started my studies at the basic level and gradually continued through the semesters up to the advanced level, without the need to repeat any semester. This learning provided me with a solid foundation in grammar, vocabulary, and listening comprehension. Thanks to this preparation, I had the opportunity to take the TOEFL ITP exam. I reached my B2 level in English.",
  "home.extracurricular1.location": "Diadema - SP",
  "home.extracurricular1.title": "English course",
  "home.extracurricular1.type": "Extracurricular",
  "home.extracurricular2.description": "A 14-hour learning short instructed by Sthephane Maarek that covers all the details for preparing for the AWS Cloud Practitioner exam. It was instrumental in my studies to achieve the renowned certification.",
  "home.extracurricular2.location": "Online",
  "home.extracurricular2.title": "Certified Cloud Practitioner (course)",
  "home.extracurricular2.type": "Extracurricular",
  "home.footer.contact.title": "Contact",
  "home.footer.copyright": "© 2022 - 2023 - All rights reserved.",
  "home.footer.requirements.title": "Copyright",
  "home.footer.socialmedia.title": "Social networking",
  "home.formation.etec.description1": "My first training in the IT area. I had the opportunity to learn about several essential topics for developing systems for the web, including Linux, networking, front-end, back-end and database. I was also able to study several programming languages, such as SQL, Java, Javascript, PHP, HTML, CSS and even JQuery.",
  "home.formation.etec.description2": "It was an enriching and fundamental experience for my professional career. It served as the basis for my higher education and mainly for my first experience as a Front End trainee.",
  "home.formation.etec.location": "Diadema - SP",
  "home.formation.etec.title": "Computers for Internet",
  "home.formation.etec.type": "Technician",
  "home.formation.fiap.description1": "During the course, I had the opportunity to learn about various subjects essential for system development, from Oracle database modeling and building, through cloud with Azure, management and engineering, to programming logic in Java, back end with C# and front end with React, HTML and CSS.",
  "home.formation.fiap.description2": "I had the opportunity to apply the knowledge in several practical projects, individually and in teams. These allowed me to improve my communication, teamwork, and problem-solving skills, providing valuable experience in full software development.",
  "home.formation.fiap.location": "Vila Mariana - SP",
  "home.formation.fiap.title": "Systems Analysis and Development",
  "home.formation.fiap.type": "Technologist",
  "home.formation.tabs1.title": "Courses",
  "home.formation.tabs2.title": "Extracurricular",
  "home.formation.tabs3.title": "Certifications",
  "home.formation.title": "Lifelong learning",
  "home.html-css.css.description": "Like HTML, CSS doesn't need any introduction to how it works, but pure CSS is not used much because in larger projects and frameworks like Angular, the use of SCSS is usually more appropriate because it facilitates the structuring of more organized style codes, something that is difficult to achieve with native CSS.",
  "home.html-css.html.description": "Markup language used to create the structure and basic content of web pages. It doesn't need much explanation, because as a Front-End developer, HTML has been the framework of the Web since its early days and consequently any framework or front-end web work, in one way or another, uses HTML.",
  "home.html-css.pug.description": "Pug is a template language that allows you to write HTML in a simplified and elegant way. With its indentation-based syntax, Pug allows developers to write more readable and organized code, saving time and effort when creating web pages. In addition, Pug has advanced features such as mixins and includes, which allow you to create reusable blocks of code and modularize your project. Because it is a template language, it is used in conjunction with task automation tools for compiling to pure HTML.",
  "home.html-css.sass.description": "A stylesheet language that serves as an extension of CSS, allowing for an easier-to-read and write syntax. It adds advanced features such as variables, mixins, functions, and nesting that help make writing styles faster and more efficient. With SCSS, you can write more complex styles in a more organized way, which makes it easier to maintain large projects. So much so that in my experience, I've hardly ever gone back to using pure CSS, it usually ends up being SASS or SCSS, which although one is usually confused with the other, SCSS has a different syntax than SASS.",
  "home.html-css.sass.functions": "Functions",
  "home.html-css.sass.mixins": "Mixins",
  "home.html-css.sass.nesting": "Nesting",
  "home.html-css.sass.variables": "Variables",
  "home.js-ts.technologies.angular.dependency-injection": "Dependency Injection",
  "home.js-ts.technologies.angular.description": "I have been working with Angular for almost 2 years. Since my first contact with Angular, I was able to quickly adapt to its concepts, such as routing, rxjs, modules and unit tests. It was with Angular that I had my first professional experience with unit testing, which brought me a deeper understanding of the importance of developing quality software. Angular became my preferred framework in the Typescript ecosystem, and my first choice for building projects with SPA.",
  "home.js-ts.technologies.angular.inputs-outputs": "Inputs/Outputs Emitters",
  "home.js-ts.technologies.angular.modules": "Modules",
  "home.js-ts.technologies.angular.providers": "Providers",
  "home.js-ts.technologies.angular.routing": "Routing",
  "home.js-ts.technologies.angular.rxjs": "RxJs",
  "home.js-ts.technologies.angular.services": "Services",
  "home.js-ts.technologies.angular.unit-testing": "Unit Tests",
  "home.js-ts.technologies.grunt.description": "JavaScript task automation tool, similar with Gulp. Basically from my experience, I have found projects that used Gulp and others, Grunt. Particularly I never made a project from scratch with Grunt as I prefer the general structure of Gulp for task automation purposes.",
  "home.js-ts.technologies.gulp.description": "JavaScript task automation tool. I've worked a lot with Gulp when I had experiences with projects using Vanilla JavaScript and Scss. It helps automate repetitive tasks such as code minification, image compression, compiling Sass/LESS files to CSS, file concatenation, and more. It works through plugins, which can be installed via the npm package manager. I have already created tasks in personal projects to perform minification, style transpose and generate PUGs for HTML.",
  "home.js-ts.technologies.javascript.async": "Async, Promises",
  "home.js-ts.technologies.javascript.closures": "Closures",
  "home.js-ts.technologies.javascript.description": "Even before I had my first professional contact with the language, I was already studying and familiarizing myself with it. Although my preference is to use Typescript, and even have already rewritten many personal projects from Javascript to Typescript, I still believe that having Javascript knowledge is crucial for any front-end developer, since the language is practically the basis of the web, despite its peculiarities, whether good or not so good.",
  "home.js-ts.technologies.javascript.dom": "DOM",
  "home.js-ts.technologies.javascript.modules": "Modules",
  "home.js-ts.technologies.javascript.optional-chaining": "Optional Chaining",
  "home.js-ts.technologies.javascript.websockets": "WEBSockets",
  "home.js-ts.technologies.jquery.description": "I had the opportunity to work extensively with jQuery in my first company, strictly on maintenance of projects that had been around for a while. While I recognize the usefulness of jQuery in legacy projects, for new projects I would prefer to use pure Javascript, as many of its features can now be implemented natively.",
  "home.js-ts.technologies.jquery.plugins": "Plugins",
  "home.js-ts.technologies.jquery.selectors": "Selectors",
  "home.js-ts.technologies.react-native.classes": "Classes",
  "home.js-ts.technologies.react-native.context": "Context",
  "home.js-ts.technologies.react-native.description": "I used React Native for an internal sales management and control project, I became familiar with the particularities of React Native compared to React on the web, such as the component styling structure, the way to debug applications and the JS Bridge. These differences and many others, superficial as they may seem, are just a part of how React Native differs from its web equivalent.",
  "home.js-ts.technologies.react-native.hooks": "Hooks",
  "home.js-ts.technologies.react-native.js-bridge": "JS Bridge",
  "home.js-ts.technologies.react-native.mobx": "Mobx",
  "home.js-ts.technologies.react-native.props": "Props",
  "home.js-ts.technologies.react-native.redux": "Redux",
  "home.js-ts.technologies.react-native.styled-components": "Styled Components",
  "home.js-ts.technologies.react.classes": "Classes",
  "home.js-ts.technologies.react.context": "Context",
  "home.js-ts.technologies.react.description": "As a JavaScript library that can be integrated with Typescript and developed by Facebook, I had my first contact with the technology still in my internship days. I have a solid knowledge in its main concepts, especially about hooks syntax. I worked on several React projects with various frameworks and design patterns, but not only that but I also had the opportunity to do mentoring sessions during my time at IBM to share and teach about React.",
  "home.js-ts.technologies.react.hooks": "Hooks",
  "home.js-ts.technologies.react.mobx": "Mobx",
  "home.js-ts.technologies.react.props": "Props",
  "home.js-ts.technologies.react.redux": "Redux",
  "home.js-ts.technologies.react.styled-components": "Styled Components",
  "home.js-ts.technologies.typescript.description": "After working on projects of different sizes and complexity, from small projects with pure Typescript to frameworks like Angular, I can say that this technology has become fundamental for me. The implementation of static typing has been a great benefit for code quality assurance and one of the reasons why I can't imagine going back to vanilla JavaScript. Using Typescript has brought security and consistency to the projects I've worked on, helping to avoid errors and improving maintainability.",
  "home.js-ts.technologies.typescript.generics": "Generics",
  "home.js-ts.technologies.typescript.interfaces": "Interfaces",
  "home.js-ts.technologies.typescript.tsconfigs": "Project Settings (TSConfig)",
  "home.js-ts.technologies.typescript.typing": "Typing",
  "home.js-ts.technologies.typescript.unions.etc": "Unions, Enums, Non-null assertion",
  "home.js-ts.technologies.webpack.description": "A module building tool for JavaScript, used for compiling and packaging code. It allows you to create a set of JavaScript files and their respective dependency files in a single output file. Webpack is widely used in modern JavaScript projects, such as React and Angular. Generally, it is not very common to modify or create Webpack configurations from scratch because many frameworks already come with preconfigurations. However, I have done personal projects where I created my own Webpack configuration from scratch.",
  "home.languages.knowledge": "Knowledge",
  "home.languages.title": "My stack",
  "home.mytimeline.aws-certification.date": "15/08/2022",
  "home.mytimeline.aws-certification.description": "My first certification with AWS. Although I had previous experience with cloud development. Now I have officially started my journey as a Cloud Practitioner.",
  "home.mytimeline.aws-certification.title": "AWS Cloud Practitioner Certification",
  "home.mytimeline.capacitation-program.date": "01/09/2019",
  "home.mytimeline.capacitation-program.description": "It ended up being a selection process lasting one month to apply for an internship position, but I still had contact with several professionals in the company during this time.",
  "home.mytimeline.capacitation-program.title": "First Job",
  "home.mytimeline.english-conclusion.date": "13/12/2018",
  "home.mytimeline.english-conclusion.description": "After 5 years of learning, I took the TOEFL ITP exam, thus finishing my English course and reaching my advanced English level.",
  "home.mytimeline.english-conclusion.title": "Ending English",
  "home.mytimeline.english-start.date": "17/07/2013",
  "home.mytimeline.english-start.description": "Although I started very early, when I was still a pre-teen, I consider it one of the most important courses in my career, because I have been able to take 5 years of classes twice a week, learning a lot about the English language, both speaking and writing.",
  "home.mytimeline.english-start.title": "English course",
  "home.mytimeline.fiap-end.date": "07/12/2020",
  "home.mytimeline.fiap-end.description": "I managed to finish my Technologist level course in Systems Analysis and Development at FIAP. The diploma signaled the end of a particularly challenging chapter in my professional life, bearing in mind the balance between academic, professional, and personal life. But even so, it was a trajectory that provided me with a lot of growth.",
  "home.mytimeline.fiap-end.title": "Higher Education",
  "home.mytimeline.fiap-start.date": "18/02/2019",
  "home.mytimeline.fiap-start.description": "It was the starting point of my career in the I.T. area.",
  "home.mytimeline.fiap-start.title": "College Admission",
  "home.mytimeline.first-mentoring-session.date": "13/03/2023",
  "home.mytimeline.first-mentoring-session.description": "As an IBM employee, I had my first opportunity to organize a series of week-long sessions for my colleagues where I could present what React is, with hands-on projects where they could ask questions live as needed.",
  "home.mytimeline.first-mentoring-session.title": "Mentoring Section",
  "home.mytimeline.freelance-project.date": "15/12/2020",
  "home.mytimeline.freelance-project.description": "In between my transition from my former company to a new one, I had my first Full Stack development opportunity. A small electrical company needed an app to collect information from customers' No Breaks, where both the employee and the customer would sign a document to be sent an email with PDF to both parties. I used AWS with Lambdas functions to fire emails and generate PDFs, while the app was made with React Native.",
  "home.mytimeline.freelance-project.title": "Freelancer Project",
  "home.mytimeline.gft.date": "01/04/2022",
  "home.mytimeline.gft.description": "This is where I had my first experience with cloud development. Using even a little bit of back end for maintaining Lambda APIs in Node, performing deploys and stacks with Cloud Formation and Front End development with React, MobX.",
  "home.mytimeline.gft.title": "Opportunity at GFT",
  "home.mytimeline.ibm.date": "12/09/2022",
  "home.mytimeline.ibm.description": "A new chapter of my life, this time at the renowned IBM. I worked mainly with Angular but what really advanced my career was my first experience with test-driven development and all the study platforms IBM has.",
  "home.mytimeline.ibm.title": "Opportunity at IBM",
  "home.mytimeline.intern.date": "01/10/2019",
  "home.mytimeline.intern.description": "Result of my performance in the training program. I ended up being chosen for the internship position.",
  "home.mytimeline.intern.title": "Internship",
  "home.mytimeline.junior-promotion.date": "01/09/2020",
  "home.mytimeline.junior-promotion.description": "Before the end of my contract as a trainee, I was promoted to Junior Front End. This was my first full time experience in the I.T. area.",
  "home.mytimeline.junior-promotion.title": "Promotion to Junior",
  "home.mytimeline.nbm.date": "01/03/2021",
  "home.mytimeline.nbm.description": "There I got my first experience not only with development but also being responsible for managing and helping colleagues within the company. It was also my first contact with Typescript and Angular.",
  "home.mytimeline.nbm.title": "Opportunity at NBM Informatica",
  "home.mytimeline.next-fiap.date": "03/11/2019",
  "home.mytimeline.next-fiap.description": "Project developed during the year 2019 when I was at FIAP. The project ended up being chosen to be presented at the FIAP fair in partnership with several technology companies. During the event, we presented our project and ended up getting second place.",
  "home.mytimeline.next-fiap.title": "Next event from Fiap",
  "home.mytimeline.omnistack-week.date": "23/03/2020",
  "home.mytimeline.omnistack-week.description": "It was a 'mini bootcamp' provided by Rocketseat, intended to help developers get a full stack project experience. But it gave me a lot of knowledge, especially with React.",
  "home.mytimeline.omnistack-week.title": "Omnistack week",
  "home.mytimeline.start.date": "05/02/2001",
  "home.mytimeline.start.description": "As every trajectory has a beginning, this is where mine begins.",
  "home.mytimeline.start.title": "Ground zero",
  "home.mytimeline.technical-formation.date": "07/12/2018",
  "home.mytimeline.technical-formation.description": "Coinciding with my graduation from high school, I presented my TCC, thus finishing my first course in the I.T. area.",
  "home.mytimeline.technical-formation.title": "Technical Training",
  "home.mytimeline.technical-start.date": "23/07/2017",
  "home.mytimeline.technical-start.description": "This is where my first contact with the I.T. area started. In special, in the programming area and with concepts such as virtualization, computing and miscellaneous.",
  "home.mytimeline.technical-start.title": "Entering the technical course",
  "home.mytimeline.title": "My trajectory",
  "home.projects.be-the-hero.paragraph1": "Application to connect NGOs and other institutions to people who are willing to help. This was my first project that I developed with the purpose of studying. It was a solution that was built based on the content of the Omnistack week that took place between 03/23/2020 and 03/27/2020",
  "home.projects.be-the-hero.paragraph2": "Omnistack week was a kind of mini bootcamp, where each day we built a different part of the application. On the first day the Front End, followed by the Back End and Database, Mobile with React Native and finally the integration of all parts.",
  "home.projects.be-the-hero.paragraph3": "It was a crucial project to help me with my learning of React. At the time, it was still very beginner.",
  "home.projects.canvas-matrix.paragraph1": "Using Javascript, HTML and CSS. I developed a project with the goal of simulating the effect of random letters falling at different intervals, on a black background, imitating the iconic effect of the Matrix movie. For this, I used Canvas' native functionality to generate the black background and draw the letters, besides implementing logic in Javascript to create the animation of the letters randomly falling on the screen.",
  "home.projects.canvas-matrix.paragraph2": "Implementing this functionality was challenging, requiring the use of advanced Javascript features such as frame animation and DOM manipulation, as well as advanced knowledge of HTML and CSS. The end result was a simulation of letters falling fluidly and randomly across the screen.",
  "home.projects.daily-journal.paragraph1": "Developed in Swift for IOS was an application that allows the user to enter entries for each day, similar to a personal diary. Upon opening the app, the user is directed to a screen where they can enter an entry for the current day. The daily entries are organized by date and can be easily accessed via a list, which shows all the days that the user has written something. Each daily entry has a title and a text field where the user can write freely.",
  "home.projects.daily-journal.paragraph2": "Advanced features of Swift were used, such as storing data locally with Core Data. In summary, this project in Swift for IOS was an opportunity to apply my knowledge in programming and mobile application development.",
  "home.projects.description": "This is where you can find my most notable personal projects. If you are interested in more detailed information about my professional projects, please contact me.",
  "home.projects.description.content1": "Test",
  "home.projects.description.content2": "Tests Tests Tests",
  "home.projects.description.title": "About my projects",
  "home.projects.finantial-data-chart.paragraph1": "Project developed for personal study in Angular using Yahoo Finance API to list stock values of several companies. It is possible to follow the evolution of the stock prices in real time, and it is possible to filter from minute-to-minute, day-to-day, month-to-month, day-to-day.",
  "home.projects.finantial-data-chart.paragraph2": "Developed in Angular using the chart-js library to create interactive charts. It was a project to apply my knowledge using a financial API, something unheard of for me until then.",
  "home.projects.fut-awesome.paragraph1": "Aiming to improve my skills in programming for mobile devices, I developed a personal project in Flutter and Dart focused on consumption of soccer APIs. This application allows access to information about games of several leagues, such as Brasileirão, Copa do Brasil, and Champions League, as well as news about the soccer world.",
  "home.projects.fut-awesome.paragraph2": "Through the integration with APIs, the application is able to display in real time the results of the games as well as the teams' standings table.",
  "home.projects.fut-awesome.paragraph3": "In addition, it is possible to view information about the players, such as goal and assist statistics, and receive notifications about upcoming games.",
  "home.projects.highlights.title": "In the Spotlight",
  "home.projects.my-projects.title": "My projects",
  "home.projects.restaurant-finder.paragraph1": "A project using React and Typescript technologies, with the goal of allowing the user to find nearby restaurants and to see ratings and comments directly in the Google Maps interface. Also, the ratings and comments were made available through the Maps API, simulating what you can find in the Maps app itself.",
  "home.projects.restaurant-finder.paragraph2": "In summary, this project was developed as a proof of concept to learn about the services that google offers in its cloud and learn more about React, as well as I also had my first contact with the Lottie library, to work with JSON animations.",
  "home.projects.snake-game.paragraph1": "Game developed with Javascript, HTML and SCSS, a recreation of the classic mobile snake game. It works natively in the browser, using Canvas functionality to design the game. The player can control the snake using the WASD keys or the arrow keys to collect food and increase his score. The difficulty of the game increases with each point, with the screen getting smaller and the speed of the snake increasing.",
  "home.projects.snake-game.paragraph2": "To create the game, I used the features of Javascript Vanilla, manipulating the DOM and Canvas, as well as implementing animations and logic. The big idea of this project was to deepen my understanding of how to create a Web game with Canvas, bringing together two things that I love.",
  "home.projects.snake-game.paragraph3": " In addition, the game can be played directly in my portfolio via a terminal command in the desktop version.",
  "home.projects.solar-system.paragraph1": "Project created with Javascript, CSS and HTML to create a 3D environment of the Solar System, using the ThreeJS library for 3D modeling. The goal was to simulate a small environment with some planets orbiting around the sun, allowing the user to navigate through them using the keyboard. The project used Canvas to create a 3D environment of the Solar System, with simple textures. I also used lighting techniques to create a simple atmosphere in the environment.",
  "home.projects.solar-system.paragraph2": "Although it is not a faithful replica, the project allowed me to study and learn a lot about 3D modeling in general and how it works on the Web.",
  "home.projects.title": "Repositories",
  "home.projects.zappy-code.paragraph1": "My first project in Swift for IOS was an app that lists the courses of a professor on the Udemy platform. The main goal of this project was to provide users with an easier and more intuitive way to find and enroll in the professor's courses.",
  "home.projects.zappy-code.paragraph2": "The application was developed using the Swift programming language and the Xcode development platform.",
  "home.swift.description": "Although I still have no professional experience with Swift, I have invested my free time in learning it, with the goal of deepening my knowledge about the mobile world. In the meantime, I have gained knowledge of the language's basic concepts, such as data types, functions, flow control structures, object orientation, protocols and even Core Data. I've also worked on small personal projects using the language, which allowed me to improve my knowledge and better understand the iOS ecosystem.",
  "home.swift.topics.collection-manipulation": "Collection Manipulation",
  "home.swift.topics.core-data": "Core Data",
  "home.swift.topics.error-handling": "Error handling",
  "home.swift.topics.optionals": "Optional",
  "home.swift.topics.type-infer": "Type Inference",
  "home.swift.topics.type-safety": "Type safety",
  "home.welcome.terminal.last-login": "Last login:",
  "home.welcome.terminal.console": "in the console.",
  "home.welcome.terminal.helper-command": "Type /help for more information",
  "home.welcome.snake-game.score": "Score",
  "home.welcome.snake-game.game-over": "Game Over",
  "home.welcome.snake-game.movement-keys": "Movement Keys",
  "home.welcome.snake-game.pause": "Pause",
  "home.welcome.snake-game.paused": "Paused",
  "home.welcome.snake-game.restart": "Start over",
  "home.welcome.terminal.game.question": "Which game was inspired by Blockade from 1976? (Just type the name)",
  "home.welcome.terminal.not-found": "Bash: command not found:",
  "home.welcome.terminal.possible-commands": "Here is a list of possible commands:",
  "home.welcome.terminal.text1.string1": "Hello, I s ",
  "home.welcome.terminal.text1.string2": "I'm Leon",
  "home.welcome.terminal.text1.string3": "andro Farias!",
  "home.welcome.terminal.text2.string1": "This is my portfolio that I put together for you to get to know a little bit about me.",
  "home.welcome.terminal.text3.string1": "I hope you enjoy!",
  "home.welcome.terminal.text4.string1": "Don't forget to get in touch!"
}
